We now know that pandas functions and their usage.<br/>
Let's enhance our knowledge by applying those techniques on Titanic dataset.

In [35]:
import pandas as pd

titanic_data = pd.read_csv('../titanic.csv')
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### map:

**Example: Encoding labels with integers using map**

In [22]:
titanic_data.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [36]:
titanic_data['Sex'] = titanic_data.Sex.map({'male':0,'female':1})
titanic_data.Sex.value_counts()

0    577
1    314
Name: Sex, dtype: int64

#### apply:

**Exmaple: Encoding labels with integer using apply**

In [29]:
titanic_data.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [38]:
def label_encoder(x):
    label = x
    if x == 'S':
        label = 0
    elif x =='C':
        label = 1
    else:
        balel = 2
    return label
titanic_data['Embarked'] = titanic_data.Embarked.apply(label_encoder)
titanic_data.Embarked.value_counts()

0    644
1    168
Q     77
Name: Embarked, dtype: int64

#### applymap:

**Example:Converting all values in dataframe to string  using applymap**

In [44]:
def add_string(x):
    return str(x)
object_titanic_data= titanic_data.applymap(add_string)
object_titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null object
Survived       891 non-null object
Pclass         891 non-null object
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null object
SibSp          891 non-null object
Parch          891 non-null object
Ticket         891 non-null object
Fare           891 non-null object
Cabin          891 non-null object
Embarked       891 non-null object
dtypes: object(12)
memory usage: 83.6+ KB

#### groupby:

** Example: To group data by Pclass **

In [55]:
grb_pclass = titanic_data.groupby('Pclass')
grb_pclass.groups

{1: Int64Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
             ...
             853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
            dtype='int64', length=216),
 2: Int64Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
             ...
             848, 854, 861, 864, 865, 866, 874, 880, 883, 886],
            dtype='int64', length=184),
 3: Int64Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
             ...
             875, 876, 877, 878, 881, 882, 884, 885, 888, 890],
            dtype='int64', length=491)}

** Example: To accesing groups using get_group()**

In [52]:
grb_pclass.get_group(1).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,17463,51.8625,E46,0
11,12,1,1,"Bonnell, Miss. Elizabeth",1,58.0,0,0,113783,26.5500,C103,0
23,24,1,1,"Sloper, Mr. William Thompson",0,28.0,0,0,113788,35.5000,A6,0

**Example: To find average fair spent on each class**

In [96]:
grb_pclass.Fare.agg('mean')

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

**Example: To see the summary statistics of groupby year object**

In [56]:
grb_pclass.describe()

          Age                                                       Fare  \
        count       mean        std   min   25%   50%   75%   max  count
Pclass
1       186.0  38.233441  14.802856  0.92  27.0  37.0  49.0  80.0  216.0
2       173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0  184.0
3       355.0  25.140620  12.495398  0.42  18.0  24.0  32.0  74.0  491.0

                  ...  SibSp      Survived                                     \
             mean ...    75%  max    count      mean       std  min  25%  50%
Pclass            ...
1       84.154687 ...    1.0  3.0    216.0  0.629630  0.484026  0.0  0.0  1.0
2       20.662183 ...    1.0  3.0    184.0  0.472826  0.500623  0.0  0.0  0.0
3       13.675550 ...    1.0  8.0    491.0  0.242363  0.428949  0.0  0.0  0.0


        75%  max
Pclass
1       1.0  1.0
2       1.0  1.0
3       0.0  1.0

[3 rows x 56 columns]

**Example: To group data using list of series**

In [61]:
grb_survived_pclass = titanic_data.groupby(['Survived','Pclass'])
grb_survived_pclass.groups

{(0,
  1): Int64Index([  6,  27,  30,  34,  35,  54,  62,  64,  83,  92,  96, 102, 110,
             118, 124, 137, 139, 155, 168, 170, 174, 177, 185, 245, 252, 262,
             263, 270, 273, 284, 295, 297, 331, 332, 336, 339, 351, 373, 377,
             434, 438, 452, 456, 462, 467, 475, 487, 492, 493, 498, 505, 515,
             527, 536, 544, 545, 555, 557, 583, 602, 625, 633, 659, 662, 671,
             694, 698, 711, 741, 745, 748, 766, 782, 789, 793, 806, 815, 822,
             867, 872],
            dtype='int64'),
 (0,
  2): Int64Index([ 20,  33,  41,  70,  72,  99, 117, 120, 122, 134, 135, 144, 145,
             148, 149, 150, 178, 181, 191, 199, 213, 217, 219, 221, 228, 232,
             234, 236, 238, 239, 242, 249, 265, 277, 292, 308, 312, 314, 317,
             342, 343, 344, 357, 361, 385, 397, 398, 405, 413, 418, 439, 450,
             463, 466, 476, 481, 529, 551, 562, 582, 586, 594, 619, 626, 637,
             655, 658, 665, 666, 672, 674, 684, 685, 695, 705, 714, 722, 723,
             728, 732, 733, 734, 757, 772, 791, 795, 800, 808, 812, 817, 841,
             848, 854, 861, 864, 883, 886],
            dtype='int64'),
 (0, 3): Int64Index([  0,   4,   5,   7,  12,  13,  14,  16,  18,  24,
             ...
             873, 876, 877, 878, 881, 882, 884, 885, 888, 890],
            dtype='int64', length=372),
 (1, 1): Int64Index([  1,   3,  11,  23,  31,  52,  55,  61,  88,  97,
             ...
             842, 849, 853, 856, 857, 862, 871, 879, 887, 889],
            dtype='int64', length=136),
 (1,
  2): Int64Index([  9,  15,  17,  21,  43,  53,  56,  58,  66,  78,  84,  98, 123,
             133, 161, 183, 190, 193, 211, 226, 237, 247, 259, 272, 288, 303,
             316, 322, 323, 327, 340, 345, 346, 387, 389, 399, 407, 416, 417,
             426, 427, 432, 437, 440, 443, 446, 458, 472, 473, 506, 516, 518,
             526, 530, 535, 543, 546, 547, 549, 570, 576, 580, 596, 600, 608,
             615, 618, 635, 651, 670, 673, 706, 717, 720, 726, 747, 750, 754,
             755, 774, 801, 827, 831, 865, 866, 874, 880],
            dtype='int64'),
 (1, 3): Int64Index([  2,   8,  10,  19,  22,  25,  28,  32,  36,  39,
             ...
             804, 821, 823, 828, 830, 838, 855, 858, 869, 875],
            dtype='int64', length=119)}

**Example: To check average age of the survived/died people as per placss**

In [71]:
grb_survived_pclass.Age.agg('mean')

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

**Example: To see the summary of group by Sex and Survival status**

In [72]:
grb_sex_survived = titanic_data.groupby(['Sex','Survived'])
grb_sex_survived.describe()

                Age                                                        \
              count       mean        std   min    25%   50%    75%   max
Sex Survived
0   0         360.0  31.618056  14.056019  1.00  21.75  29.0  39.25  74.0
    1          93.0  27.276022  16.504803  0.42  18.00  28.0  36.00  80.0
1   0          64.0  25.046875  13.618591  2.00  16.75  24.5  33.25  57.0
    1         197.0  28.847716  14.175073  0.75  19.00  28.0  38.00  63.0

               Fare            ...  Pclass       SibSp                      \
              count       mean ...     75%  max  count      mean       std
Sex Survived                   ...
0   0         468.0  21.960993 ...     3.0  3.0  468.0  0.440171  1.138507
    1         109.0  40.821484 ...     3.0  3.0  109.0  0.385321  0.636952
1   0          81.0  23.024385 ...     3.0  3.0   81.0  1.209877  1.814635
    1         233.0  51.938573 ...     3.0  3.0  233.0  0.515021  0.737533


              min  25%  50%  75%  max
Sex Survived
0   0         0.0  0.0  0.0  0.0  8.0
    1         0.0  0.0  0.0  1.0  4.0
1   0         0.0  0.0  1.0  1.0  8.0
    1         0.0  0.0  0.0  1.0  4.0

[4 rows x 48 columns]

**Example: To check the average age of group based on Sex and Suvival status**

In [70]:
grb_sex_survived.Age.agg('mean')

Sex  Survived
0    0           31.618056
     1           27.276022
1    0           25.046875
     1           28.847716
Name: Age, dtype: float64

### Str:

** Example: To Deal with string operations**

In [87]:
titanic_data ['First Name'] = titanic_data.Name.str.split(',').apply(lambda x: x[0])
titanic_data ['Last Name'] = titanic_data.Name.str.split(',').apply(lambda x: x[1])

In [89]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First Name,Last Name
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0,Allen,Mr. William Henry

**Example: Finding length of each entry in columns Name**

In [94]:
titanic_data.Name.str.len().head()

0    23
1    51
2    22
3    44
4    24
Name: Name, dtype: int64